---
kind: type
id: T:Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException
source: html/0612a676-b6ba-8c37-2e28-b197438305ab.htm
---
# Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException

The exception that is thrown when the optional functionality is not available in the installed Revit

## Syntax (C#)
```csharp
[SerializableAttribute]
public class OptionalFunctionalityNotAvailableException : InvalidOperationException
```